/* automatically generated by rust-bindgen 0.72.0 */

pub const _VCRT_COMPILER_PREPROCESSOR: u32 = 1;
pub const _SAL_VERSION: u32 = 20;
pub const __SAL_H_VERSION: u32 = 180000000;
pub const _USE_DECLSPECS_FOR_SAL: u32 = 0;
pub const _USE_ATTRIBUTES_FOR_SAL: u32 = 0;
pub const _CRT_PACKING: u32 = 8;
pub const _HAS_EXCEPTIONS: u32 = 1;
pub const _STL_LANG: u32 = 0;
pub const _HAS_CXX17: u32 = 0;
pub const _HAS_CXX20: u32 = 0;
pub const _HAS_CXX23: u32 = 0;
pub const _HAS_CXX26: u32 = 0;
pub const _HAS_NODISCARD: u32 = 0;
pub const WCHAR_MIN: u32 = 0;
pub const WCHAR_MAX: u32 = 65535;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 65535;
pub const _ARM_WINAPI_PARTITION_DESKTOP_SDK_AVAILABLE: u32 = 1;
pub const _CRT_BUILD_DESKTOP_APP: u32 = 1;
pub const _ARGMAX: u32 = 100;
pub const _CRT_INT_MAX: u32 = 2147483647;
pub const _CRT_FUNCTIONS_REQUIRED: u32 = 1;
pub const _CRT_HAS_CXX17: u32 = 0;
pub const _CRT_HAS_C11: u32 = 1;
pub const _CRT_INTERNAL_NONSTDC_NAMES: u32 = 1;
pub const __STDC_SECURE_LIB__: u32 = 200411;
pub const __GOT_SECURE_LIB__: u32 = 200411;
pub const __STDC_WANT_SECURE_LIB__: u32 = 1;
pub const _SECURECRT_FILL_BUFFER_PATTERN: u32 = 254;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES_COUNT: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_SECURE_NAMES: u32 = 1;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES_MEMORY: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_SECURE_NAMES_MEMORY: u32 = 0;

pub const SCN_FOCUSOUT: u32 = 2029;
pub const SCN_AUTOCCOMPLETED: u32 = 2030;
pub const SCN_MARGINRIGHTCLICK: u32 = 2031;
pub const SCN_AUTOCSELECTIONCHANGE: u32 = 2032;
pub const SC_BIDIRECTIONAL_DISABLED: u32 = 0;
pub const SC_BIDIRECTIONAL_L2R: u32 = 1;
pub const SC_BIDIRECTIONAL_R2L: u32 = 2;
pub const SCI_GETBIDIRECTIONAL: u32 = 2708;
pub const SCI_SETBIDIRECTIONAL: u32 = 2709;
unsafe extern "C" {
    pub fn Scintilla_RegisterClasses(
        hInstance: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn Scintilla_ReleaseResources() -> ::std::os::raw::c_int;
}
pub type va_list = *mut ::std::os::raw::c_char;
unsafe extern "C" {
    pub fn __va_start(arg1: *mut *mut ::std::os::raw::c_char, ...);
}
pub type __vcrt_bool = bool;
pub type wchar_t = ::std::os::raw::c_ushort;
unsafe extern "C" {
    pub fn __security_init_cookie();
}
unsafe extern "C" {
    pub fn __security_check_cookie(_StackCookie: usize);
}
unsafe extern "C" {
    pub fn __report_gsfailure(_StackCookie: usize) -> !;
}
unsafe extern "C" {
    pub static mut __security_cookie: usize;
}
pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_longlong;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulonglong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_int;
pub type int_fast32_t = ::std::os::raw::c_int;
pub type int_fast64_t = ::std::os::raw::c_longlong;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_uint;
pub type uint_fast32_t = ::std::os::raw::c_uint;
pub type uint_fast64_t = ::std::os::raw::c_ulonglong;
pub type intmax_t = ::std::os::raw::c_longlong;
pub type uintmax_t = ::std::os::raw::c_ulonglong;
pub type uptr_t = usize;
pub type sptr_t = isize;
pub type __crt_bool = bool;
unsafe extern "C" {
    pub fn _invalid_parameter_noinfo();
}
unsafe extern "C" {
    pub fn _invalid_parameter_noinfo_noreturn() -> !;
}
unsafe extern "C" {
    pub fn _invoke_watson(
        _Expression: *const wchar_t,
        _FunctionName: *const wchar_t,
        _FileName: *const wchar_t,
        _LineNo: ::std::os::raw::c_uint,
        _Reserved: usize,
    ) -> !;
}
pub type errno_t = ::std::os::raw::c_int;
pub type wint_t = ::std::os::raw::c_ushort;
pub type wctype_t = ::std::os::raw::c_ushort;
pub type __time32_t = ::std::os::raw::c_long;
pub type __time64_t = ::std::os::raw::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_data_public {
    pub _locale_pctype: *const ::std::os::raw::c_ushort,
    pub _locale_mb_cur_max: ::std::os::raw::c_int,
    pub _locale_lc_codepage: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __crt_locale_data_public"]
        [::std::mem::size_of::<__crt_locale_data_public>() - 16usize];
    ["Alignment of __crt_locale_data_public"]
        [::std::mem::align_of::<__crt_locale_data_public>() - 8usize];
    ["Offset of field: __crt_locale_data_public::_locale_pctype"]
        [::std::mem::offset_of!(__crt_locale_data_public, _locale_pctype) - 0usize];
    ["Offset of field: __crt_locale_data_public::_locale_mb_cur_max"]
        [::std::mem::offset_of!(__crt_locale_data_public, _locale_mb_cur_max) - 8usize];
    ["Offset of field: __crt_locale_data_public::_locale_lc_codepage"]
        [::std::mem::offset_of!(__crt_locale_data_public, _locale_lc_codepage) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_pointers {
    pub locinfo: *mut __crt_locale_data,
    pub mbcinfo: *mut __crt_multibyte_data,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __crt_locale_pointers"][::std::mem::size_of::<__crt_locale_pointers>() - 16usize];
    ["Alignment of __crt_locale_pointers"]
        [::std::mem::align_of::<__crt_locale_pointers>() - 8usize];
    ["Offset of field: __crt_locale_pointers::locinfo"]
        [::std::mem::offset_of!(__crt_locale_pointers, locinfo) - 0usize];
    ["Offset of field: __crt_locale_pointers::mbcinfo"]
        [::std::mem::offset_of!(__crt_locale_pointers, mbcinfo) - 8usize];
};
pub type _locale_t = *mut __crt_locale_pointers;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Mbstatet {
    pub _Wchar: ::std::os::raw::c_ulong,
    pub _Byte: ::std::os::raw::c_ushort,
    pub _State: ::std::os::raw::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _Mbstatet"][::std::mem::size_of::<_Mbstatet>() - 8usize];
    ["Alignment of _Mbstatet"][::std::mem::align_of::<_Mbstatet>() - 4usize];
    ["Offset of field: _Mbstatet::_Wchar"][::std::mem::offset_of!(_Mbstatet, _Wchar) - 0usize];
    ["Offset of field: _Mbstatet::_Byte"][::std::mem::offset_of!(_Mbstatet, _Byte) - 4usize];
    ["Offset of field: _Mbstatet::_State"][::std::mem::offset_of!(_Mbstatet, _State) - 6usize];
};
pub type mbstate_t = _Mbstatet;
pub type time_t = __time64_t;
pub type rsize_t = usize;
unsafe extern "C" {
    pub fn _errno() -> *mut ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _set_errno(_Value: ::std::os::raw::c_int) -> errno_t;
}
unsafe extern "C" {
    pub fn _get_errno(_Value: *mut ::std::os::raw::c_int) -> errno_t;
}
unsafe extern "C" {
    pub fn __threadid() -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn __threadhandle() -> usize;
}
pub type Sci_Position = isize;
pub type Sci_PositionU = usize;
pub type Sci_PositionCR = ::std::os::raw::c_long;
pub type SciFnDirect = ::std::option::Option<
    unsafe extern "C" fn(
        ptr: sptr_t,
        iMessage: ::std::os::raw::c_uint,
        wParam: uptr_t,
        lParam: sptr_t,
    ) -> sptr_t,
>;
pub type SciFnDirectStatus = ::std::option::Option<
    unsafe extern "C" fn(
        ptr: sptr_t,
        iMessage: ::std::os::raw::c_uint,
        wParam: uptr_t,
        lParam: sptr_t,
        pStatus: *mut ::std::os::raw::c_int,
    ) -> sptr_t,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Sci_CharacterRange {
    pub cpMin: Sci_PositionCR,
    pub cpMax: Sci_PositionCR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Sci_CharacterRange"][::std::mem::size_of::<Sci_CharacterRange>() - 8usize];
    ["Alignment of Sci_CharacterRange"][::std::mem::align_of::<Sci_CharacterRange>() - 4usize];
    ["Offset of field: Sci_CharacterRange::cpMin"]
        [::std::mem::offset_of!(Sci_CharacterRange, cpMin) - 0usize];
    ["Offset of field: Sci_CharacterRange::cpMax"]
        [::std::mem::offset_of!(Sci_CharacterRange, cpMax) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Sci_CharacterRangeFull {
    pub cpMin: Sci_Position,
    pub cpMax: Sci_Position,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Sci_CharacterRangeFull"][::std::mem::size_of::<Sci_CharacterRangeFull>() - 16usize];
    ["Alignment of Sci_CharacterRangeFull"]
        [::std::mem::align_of::<Sci_CharacterRangeFull>() - 8usize];
    ["Offset of field: Sci_CharacterRangeFull::cpMin"]
        [::std::mem::offset_of!(Sci_CharacterRangeFull, cpMin) - 0usize];
    ["Offset of field: Sci_CharacterRangeFull::cpMax"]
        [::std::mem::offset_of!(Sci_CharacterRangeFull, cpMax) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Sci_TextRange {
    pub chrg: Sci_CharacterRange,
    pub lpstrText: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Sci_TextRange"][::std::mem::size_of::<Sci_TextRange>() - 16usize];
    ["Alignment of Sci_TextRange"][::std::mem::align_of::<Sci_TextRange>() - 8usize];
    ["Offset of field: Sci_TextRange::chrg"][::std::mem::offset_of!(Sci_TextRange, chrg) - 0usize];
    ["Offset of field: Sci_TextRange::lpstrText"]
        [::std::mem::offset_of!(Sci_TextRange, lpstrText) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Sci_TextRangeFull {
    pub chrg: Sci_CharacterRangeFull,
    pub lpstrText: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Sci_TextRangeFull"][::std::mem::size_of::<Sci_TextRangeFull>() - 24usize];
    ["Alignment of Sci_TextRangeFull"][::std::mem::align_of::<Sci_TextRangeFull>() - 8usize];
    ["Offset of field: Sci_TextRangeFull::chrg"]
        [::std::mem::offset_of!(Sci_TextRangeFull, chrg) - 0usize];
    ["Offset of field: Sci_TextRangeFull::lpstrText"]
        [::std::mem::offset_of!(Sci_TextRangeFull, lpstrText) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Sci_TextToFind {
    pub chrg: Sci_CharacterRange,
    pub lpstrText: *const ::std::os::raw::c_char,
    pub chrgText: Sci_CharacterRange,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Sci_TextToFind"][::std::mem::size_of::<Sci_TextToFind>() - 24usize];
    ["Alignment of Sci_TextToFind"][::std::mem::align_of::<Sci_TextToFind>() - 8usize];
    ["Offset of field: Sci_TextToFind::chrg"]
        [::std::mem::offset_of!(Sci_TextToFind, chrg) - 0usize];
    ["Offset of field: Sci_TextToFind::lpstrText"]
        [::std::mem::offset_of!(Sci_TextToFind, lpstrText) - 8usize];
    ["Offset of field: Sci_TextToFind::chrgText"]
        [::std::mem::offset_of!(Sci_TextToFind, chrgText) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Sci_TextToFindFull {
    pub chrg: Sci_CharacterRangeFull,
    pub lpstrText: *const ::std::os::raw::c_char,
    pub chrgText: Sci_CharacterRangeFull,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Sci_TextToFindFull"][::std::mem::size_of::<Sci_TextToFindFull>() - 40usize];
    ["Alignment of Sci_TextToFindFull"][::std::mem::align_of::<Sci_TextToFindFull>() - 8usize];
    ["Offset of field: Sci_TextToFindFull::chrg"]
        [::std::mem::offset_of!(Sci_TextToFindFull, chrg) - 0usize];
    ["Offset of field: Sci_TextToFindFull::lpstrText"]
        [::std::mem::offset_of!(Sci_TextToFindFull, lpstrText) - 16usize];
    ["Offset of field: Sci_TextToFindFull::chrgText"]
        [::std::mem::offset_of!(Sci_TextToFindFull, chrgText) - 24usize];
};
pub type Sci_SurfaceID = *mut ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Sci_Rectangle {
    pub left: ::std::os::raw::c_int,
    pub top: ::std::os::raw::c_int,
    pub right: ::std::os::raw::c_int,
    pub bottom: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Sci_Rectangle"][::std::mem::size_of::<Sci_Rectangle>() - 16usize];
    ["Alignment of Sci_Rectangle"][::std::mem::align_of::<Sci_Rectangle>() - 4usize];
    ["Offset of field: Sci_Rectangle::left"][::std::mem::offset_of!(Sci_Rectangle, left) - 0usize];
    ["Offset of field: Sci_Rectangle::top"][::std::mem::offset_of!(Sci_Rectangle, top) - 4usize];
    ["Offset of field: Sci_Rectangle::right"]
        [::std::mem::offset_of!(Sci_Rectangle, right) - 8usize];
    ["Offset of field: Sci_Rectangle::bottom"]
        [::std::mem::offset_of!(Sci_Rectangle, bottom) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Sci_RangeToFormat {
    pub hdc: Sci_SurfaceID,
    pub hdcTarget: Sci_SurfaceID,
    pub rc: Sci_Rectangle,
    pub rcPage: Sci_Rectangle,
    pub chrg: Sci_CharacterRange,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Sci_RangeToFormat"][::std::mem::size_of::<Sci_RangeToFormat>() - 56usize];
    ["Alignment of Sci_RangeToFormat"][::std::mem::align_of::<Sci_RangeToFormat>() - 8usize];
    ["Offset of field: Sci_RangeToFormat::hdc"]
        [::std::mem::offset_of!(Sci_RangeToFormat, hdc) - 0usize];
    ["Offset of field: Sci_RangeToFormat::hdcTarget"]
        [::std::mem::offset_of!(Sci_RangeToFormat, hdcTarget) - 8usize];
    ["Offset of field: Sci_RangeToFormat::rc"]
        [::std::mem::offset_of!(Sci_RangeToFormat, rc) - 16usize];
    ["Offset of field: Sci_RangeToFormat::rcPage"]
        [::std::mem::offset_of!(Sci_RangeToFormat, rcPage) - 32usize];
    ["Offset of field: Sci_RangeToFormat::chrg"]
        [::std::mem::offset_of!(Sci_RangeToFormat, chrg) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Sci_RangeToFormatFull {
    pub hdc: Sci_SurfaceID,
    pub hdcTarget: Sci_SurfaceID,
    pub rc: Sci_Rectangle,
    pub rcPage: Sci_Rectangle,
    pub chrg: Sci_CharacterRangeFull,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Sci_RangeToFormatFull"][::std::mem::size_of::<Sci_RangeToFormatFull>() - 64usize];
    ["Alignment of Sci_RangeToFormatFull"]
        [::std::mem::align_of::<Sci_RangeToFormatFull>() - 8usize];
    ["Offset of field: Sci_RangeToFormatFull::hdc"]
        [::std::mem::offset_of!(Sci_RangeToFormatFull, hdc) - 0usize];
    ["Offset of field: Sci_RangeToFormatFull::hdcTarget"]
        [::std::mem::offset_of!(Sci_RangeToFormatFull, hdcTarget) - 8usize];
    ["Offset of field: Sci_RangeToFormatFull::rc"]
        [::std::mem::offset_of!(Sci_RangeToFormatFull, rc) - 16usize];
    ["Offset of field: Sci_RangeToFormatFull::rcPage"]
        [::std::mem::offset_of!(Sci_RangeToFormatFull, rcPage) - 32usize];
    ["Offset of field: Sci_RangeToFormatFull::chrg"]
        [::std::mem::offset_of!(Sci_RangeToFormatFull, chrg) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Sci_NotifyHeader {
    pub hwndFrom: *mut ::std::os::raw::c_void,
    pub idFrom: uptr_t,
    pub code: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Sci_NotifyHeader"][::std::mem::size_of::<Sci_NotifyHeader>() - 24usize];
    ["Alignment of Sci_NotifyHeader"][::std::mem::align_of::<Sci_NotifyHeader>() - 8usize];
    ["Offset of field: Sci_NotifyHeader::hwndFrom"]
        [::std::mem::offset_of!(Sci_NotifyHeader, hwndFrom) - 0usize];
    ["Offset of field: Sci_NotifyHeader::idFrom"]
        [::std::mem::offset_of!(Sci_NotifyHeader, idFrom) - 8usize];
    ["Offset of field: Sci_NotifyHeader::code"]
        [::std::mem::offset_of!(Sci_NotifyHeader, code) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCNotification {
    pub nmhdr: Sci_NotifyHeader,
    pub position: Sci_Position,
    pub ch: ::std::os::raw::c_int,
    pub modifiers: ::std::os::raw::c_int,
    pub modificationType: ::std::os::raw::c_int,
    pub text: *const ::std::os::raw::c_char,
    pub length: Sci_Position,
    pub linesAdded: Sci_Position,
    pub message: ::std::os::raw::c_int,
    pub wParam: uptr_t,
    pub lParam: sptr_t,
    pub line: Sci_Position,
    pub foldLevelNow: ::std::os::raw::c_int,
    pub foldLevelPrev: ::std::os::raw::c_int,
    pub margin: ::std::os::raw::c_int,
    pub listType: ::std::os::raw::c_int,
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub token: ::std::os::raw::c_int,
    pub annotationLinesAdded: Sci_Position,
    pub updated: ::std::os::raw::c_int,
    pub listCompletionMethod: ::std::os::raw::c_int,
    pub characterSource: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SCNotification"][::std::mem::size_of::<SCNotification>() - 160usize];
    ["Alignment of SCNotification"][::std::mem::align_of::<SCNotification>() - 8usize];
    ["Offset of field: SCNotification::nmhdr"]
        [::std::mem::offset_of!(SCNotification, nmhdr) - 0usize];
    ["Offset of field: SCNotification::position"]
        [::std::mem::offset_of!(SCNotification, position) - 24usize];
    ["Offset of field: SCNotification::ch"][::std::mem::offset_of!(SCNotification, ch) - 32usize];
    ["Offset of field: SCNotification::modifiers"]
        [::std::mem::offset_of!(SCNotification, modifiers) - 36usize];
    ["Offset of field: SCNotification::modificationType"]
        [::std::mem::offset_of!(SCNotification, modificationType) - 40usize];
    ["Offset of field: SCNotification::text"]
        [::std::mem::offset_of!(SCNotification, text) - 48usize];
    ["Offset of field: SCNotification::length"]
        [::std::mem::offset_of!(SCNotification, length) - 56usize];
    ["Offset of field: SCNotification::linesAdded"]
        [::std::mem::offset_of!(SCNotification, linesAdded) - 64usize];
    ["Offset of field: SCNotification::message"]
        [::std::mem::offset_of!(SCNotification, message) - 72usize];
    ["Offset of field: SCNotification::wParam"]
        [::std::mem::offset_of!(SCNotification, wParam) - 80usize];
    ["Offset of field: SCNotification::lParam"]
        [::std::mem::offset_of!(SCNotification, lParam) - 88usize];
    ["Offset of field: SCNotification::line"]
        [::std::mem::offset_of!(SCNotification, line) - 96usize];
    ["Offset of field: SCNotification::foldLevelNow"]
        [::std::mem::offset_of!(SCNotification, foldLevelNow) - 104usize];
    ["Offset of field: SCNotification::foldLevelPrev"]
        [::std::mem::offset_of!(SCNotification, foldLevelPrev) - 108usize];
    ["Offset of field: SCNotification::margin"]
        [::std::mem::offset_of!(SCNotification, margin) - 112usize];
    ["Offset of field: SCNotification::listType"]
        [::std::mem::offset_of!(SCNotification, listType) - 116usize];
    ["Offset of field: SCNotification::x"][::std::mem::offset_of!(SCNotification, x) - 120usize];
    ["Offset of field: SCNotification::y"][::std::mem::offset_of!(SCNotification, y) - 124usize];
    ["Offset of field: SCNotification::token"]
        [::std::mem::offset_of!(SCNotification, token) - 128usize];
    ["Offset of field: SCNotification::annotationLinesAdded"]
        [::std::mem::offset_of!(SCNotification, annotationLinesAdded) - 136usize];
    ["Offset of field: SCNotification::updated"]
        [::std::mem::offset_of!(SCNotification, updated) - 144usize];
    ["Offset of field: SCNotification::listCompletionMethod"]
        [::std::mem::offset_of!(SCNotification, listCompletionMethod) - 148usize];
    ["Offset of field: SCNotification::characterSource"]
        [::std::mem::offset_of!(SCNotification, characterSource) - 152usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_data {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_multibyte_data {
    pub _address: u8,
}
